app/Http/Controllers/QuestionController.php

select count(*) as aggregate from `questions`
select * from `questions` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 2, 3, 4)
---
    public function index()
    {
        //
        /*
         * only to show result in query format we are changing view
         * other wise this works fine
         * [
         * $question= Question::latest()->paginate(5);
        return view('question.index',compact('question'));
         * ]
         * new changed function is [
         *\DB :: enableQueryLog();
        $question= Question::with('user')->latest()->paginate(10);
        view('question.index',compact('question'))->render();
        dd(\DB::getQueryLog());
         * ]
         * */
        \DB :: enableQueryLog();
        $question= Question::with('user')->latest()->paginate(10);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-03-21 18:31:00' where `id` = 1
---
    public function show(Question $question)
    {
        //
        $question->increment('views');

update `questions` set `title` = 'What is a coronavirus or COVID-19?', `slug` = 'what-is-a-coronavirus-or-covid-19', `body` = 'Coronaviruses or COVID-19\'s are a large family of viruses that may cause illness in animals or humans.  In humans, several coronaviruses are known to cause respiratory infections ranging from the common cold to more severe diseases such as Middle East Respiratory Syndrome (MERS) and Severe Acute Respiratory Syndrome (SARS). The most recently discovered coronavirus causes coronavirus disease COVID-19.', `questions`.`updated_at` = '2020-03-21 16:07:51' where `id` = 7
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        $question->update($request->only('title','body'));

delete from `questions` where `id` = 7
---
    public function destroy(Question $question)
    {
        $question->delete();