app/Providers/RouteServiceProvider.php

select * from `questions` where `slug` = 'quod-porro-iusto-dolorum-porro-eveniet-quae-ipsum-unde-architecto-perspiciatis-recusandae-quia' limit 1
---
    public function boot()
    {
        //
        Route::bind('slug',function ($slug){
           return Question::where('slug',$slug)->first() ?? abort(404);